---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyDeleteTypeWarn
source: html/ade11df0-8cbc-3257-fad1-3442d8f390ef.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyDeleteTypeWarn Property

Edits to these assemblies changed the naming category and name of these assemblies.

## Syntax (C#)
```csharp
public static FailureDefinitionId AssemblyDeleteTypeWarn { get; }
```